def simple_or_not (x: int):
    """ Перевіряє чи є число простим(просте / не просте),
        Чи ділиться воно саме на себе та на 1"""
    if x <= 1:
        return 'не просте'
    for i in range(2, int(x**0.5)+1):
        if x % i == 0:
            return 'не просте'
    return 'просте'
# print(simple_or_not(7))

# # Число n є простим, якщо:
# # це натуральне число більше 1
# # і немає жодного дільника, крім 1 і n

# # 🔍 Як перевірити:
# # Якщо n <= 1 — не просте
# # Інакше — перевіряємо, чи ділиться на будь-яке число від 2 до √n:
# # якщо хоч одне ділить → не просте
# # якщо жодне не ділить → просте
# # Чому до √n? Якщо число має дільник більше кореня — інший дільник вже буде менше √n.